#pragma once


//摄像头的分辨率（图形尺寸：宽度）  
#define IMAGEWIDTH 2448  
//摄像头的分辨率（图形尺寸：高度）  
#define IMAGEHEIGHT 2048

//内参矩阵  MATLAB原生矩阵需要转置后使用
//fx  0    u0
//0   fy   v0
//0   0    1
#define CAMERAMATRIX57 (Mat_<double>(3, 3) << 4741.0113, 0.2997, 1240.6900, 0.0000, 4740.3574, 1014.1204, 0.0000, 0.0000, 1.0000)

//内参矩阵  MATLAB原生矩阵需要转置后使用
//fx  0    u0
//0   fy   v0
//0   0    1
#define CAMERAMATRIX82 (Mat_<double>(3, 3) << 4740.5134, 0.3667, 1254.0405, 0.0000, 4740.5156, 1073.5144, 0.0000, 0.0000, 1.0000)

//外参矩阵

//T平移矩阵 1相机为57 2相机为82
#define TRAN57_82 (Mat_<double>(3, 1) << 88.1268, 0.5178, 0.6675)
//R旋转矩阵 1相机为57 2相机为82 MATLAB原生矩阵需要转置后使用
#define ROT57_82 (Mat_<double>(3, 3) << 0.9997, 0.0024, -0.0235, -0.0023, 1.0000, 0.0045, 0.0235, -0.0044, 0.9997)

//T平移矩阵 1相机为82 2相机为57
#define TRAN82_57 (Mat_<double>(3, 1) << -88.1166, -0.7306, 1.4022)
//R旋转矩阵 1相机为82 2相机为57 MATLAB原生矩阵需要转置后使用
#define ROT82_57 (Mat_<double>(3, 3) << 0.9997, -0.0023, 0.0235, 0.0024, 1.0000, -0.0044, -0.0235, 0.0045, 0.9997)



//相机畸变参数 K1 K2 P1 P2 K3
#define DISTORTION57 (Mat_<double>(5, 1) << -0.0241, 0.3349, 0.0001, 0.0000, 0.3050)
//相机畸变参数 K1 K2 P1 P2 K3
#define DISTORTION82 (Mat_<double>(5, 1) << -0.0271, 0.3419, -0.0002, 0.0006, -0.2961)

