#pragma once


//摄像头的分辨率（图形尺寸：宽度）  
#define IMAGEWIDTH 306  
//摄像头的分辨率（图形尺寸：高度）  
#define IMAGEHEIGHT 256

//内参矩阵  MATLAB原生矩阵需要转置后使用
//fx  0    u0
//0   fy   v0
//0   0    1
#define CAMERAMATRIX57 (Mat_<double>(3, 3) << 594.4025, 0.0292, 155.7843, 0.0000, 594.2851, 127.1127, 0.0000, 0.0000, 1.0000)


//内参矩阵  MATLAB原生矩阵需要转置后使用
//fx  0    u0
//0   fy   v0
//0   0    1
#define CAMERAMATRIX82 (Mat_<double>(3, 3) << 592.5959, 0.0113, 158.2683, 0.0000, 592.6399, 133.3030, 0.0000, 0.0000, 1.0000)



//外参矩阵

//T平移矩阵 1相机为57 2相机为82
#define TRAN57_82 (Mat_<double>(3, 1) << 88.0746, 1.2800, -1.3485)
//R旋转矩阵 1相机为57 2相机为82 MATLAB原生矩阵需要转置后使用
#define ROT57_82 (Mat_<double>(3, 3) << 0.9997, 0.0024, -0.0248, -0.0023, 1.0000, 0.0056, 0.0248, -0.0056, 0.9997)





//相机畸变参数 K1 K2 P1 P2 K3
#define DISTORTION57 (Mat_<double>(4, 1) << -0.0324, 0.4607, -0.0003, 0.0000)
//相机畸变参数 K1 K2 P1 P2 K3
#define DISTORTION82 (Mat_<double>(4, 1) << 0.0274, -2.8382, -0.0007, 0.0011)


